app/views/home/index.html.erb

                      <% if user_signed_in? %>
                        <% like = post.likes.find { |like| like.user_id == current_user.id } %>
---
SELECT "users".* FROM "users"