app/controllers/home_controller.rb

  def index
    @q = User.ransack(params[:q])
    if params[:country].present?
      @users = User.includes(:connections, :posts, :comments, :notifications).where(country: params[:country]).order(created_at: :asc).limit(16)
    else
      @users = @q.result(distinct: true).includes(:connections, :posts, :comments, :notifications).order(created_at: :asc).limit(16)
---
SELECT DISTINCT "users".* FROM "users" WHERE "users"."country" = $1 ORDER BY "users"."created_at" ASC LIMIT $2  [["country", "Vietnam"], ["LIMIT", 16]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT DISTINCT "users".* FROM "users" ORDER BY "users"."created_at" ASC LIMIT $1  [["LIMIT", 16]]