app/controllers/home_controller.rb

  def index
    @posts = Post.includes(:likes, :comments, :reposts, :user_reactions, user: [:reposts, :groups, :user_reactions, :follows, :notifications, :articles, image_attachment: :blob], images_attachments: :blob).order(created_at: :desc)
    @post_likes_count = Post.joins(:likes).group('posts.id').count
    comment_counts = Comment.where(commentable_id: @posts.map(&:id),
                     commentable_type: 'Post')
                     .group(:commentable_id)
                     .count

    # Now, you can create a hash where keys are post IDs and values are comment counts
    @post_comment_counts = comment_counts.transform_keys(&:to_i)


    # user_reaction_counts = UserReaction.where(reactable_id: @posts.map(&:id),
    #                  reactable_type: 'Post')
    #                  .group(:reactable_id)
    #                  .count

    # Now, you can create a hash where keys are post IDs and values are comment counts
    #@post_user_reaction_counts = user_reaction_counts.transform_keys(&:to_i)

    # for showing the total connected user ids count of current user
    @total_connections = Connection.where('user_id = ? OR connected_user_id = ?', current_user.id, current_user.id).where(status: 'accepted')
    @groups = Group.all
---
SELECT COUNT(*) AS "count_all", "posts"."id" AS "posts_id" FROM "posts" INNER JOIN "likes" ON "likes"."post_id" = "posts"."id" GROUP BY "posts"."id"
SELECT COUNT(*) AS "count_all", "comments"."commentable_id" AS "comments_commentable_id" FROM "comments" WHERE 1=0 AND "comments"."commentable_type" = $1 GROUP BY "comments"."commentable_id"  [["commentable_type", "Post"]]
SELECT COUNT(*) FROM "connections" WHERE (user_id = 25 OR connected_user_id = 25) AND "connections"."status" = $1  [["status", "accepted"]]
SELECT "groups".* FROM "groups"