app/controllers/members_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @user = User.find(params[:id]) # Or whatever logic you use to find the user

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "John"], ["updated_at", "2023-07-21 07:08:37.970063"], ["id", 1]]
---
  def update
  @user = User.find(params[:id])
  if @user.update(user_params)