app/controllers/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "elin_stoltenberg@robel-adams.example"], ["LIMIT", 1]]
UPDATE "users" SET "sign_in_count" = $1, "current_sign_in_at" = $2, "last_sign_in_at" = $3, "current_sign_in_ip" = $4, "last_sign_in_ip" = $5, "updated_at" = $6 WHERE "users"."id" = $7
---
  def create
    self.resource = User.find_by(email: params[:user][:email])

    if resource
      # Generate and save the OTP
      resource.generate_otp
      resource.generate_otp_token # Generate a unique OTP token
      resource.save